import { ScrollArea, Text, TypographyStylesProvider } from "@mantine/core";
export function About() {
  return (
    <ScrollArea dir="rtl" h={"100%"}>
      <Text lineClamp={50} component="div">
        <TypographyStylesProvider>
          <h3>مبانی ایمان بر مبنای کلام یهوه الله</h3>
          <p style={{ whiteSpace: "pre-line" }}>
            {`بسم الله الرحمن الرحیم

ما مسلمان هستیم و خود را ملزم به تبعیت از کلام وحی می دانیم و به موارد ذیل ایمان داریم:

1. منابع دین اسلام طبق شهادت کلام وحی، قرآن و کتب من قبل است. منظور از کتب من قبل آن کتاب هایی است که قرآن از آنها به طور مستقیم و غیر مستقیم تحت عنوان صحف اولی، تورات و صحف انبیا (39 صحیفه عهدعتیق) و انجیل متشکل از 4 صحیفه (متی، مرقس، لوقا و یوحنا) نام برده است.

2. ما عامل و پایبند به شریعت قرآن هستیم. رجوع به تورات و انجیل در حوزه شریعت، صرفا باید طبق رهنمودهای قرآن صورت پذیرد.

3. مطابق شهادتهای مکرر کلام وحی، تورات، صحف انبیا و چهار صحیفه انجیل عاری از هر گونه تغییر و دست خوردگی است. به عبارت دیگر صحت متون مقدس تورات و صحف انبیا و انجیل مورد تایید و تصدیق قرآن است. و قرآن اجازه نمی دهد که فهم خواننده از کتب پیشین آلوده به انحراف گردد.

4. هیچ منبع دیگری (مانند احادیث و روایات، تاریخ و شان نزول) به غیر از کلام وحی اعتبار و جایگاهی در دایره دین اسلام ندارد. تلمود و کتابهای مراجع یهودی یا نامه های نوشته شده توسط پولوس و کتاب مکاشفه یا کتابهای پدران کلیسا و نیز کتابهای مذاهب سنی و شیعه و فرقه های آنها جزو منابع دین اسلام محسوب نمی شوند.

5. قرآن آخرین کتاب نازل شده در زنجیره کلام وحی است و تمامی انبیایی که از جانب الله فرستاده شده اند مسلمان بوده اند. و طبق فرموده قرآن هیچ فرقی بین انبیا نباید گذاشته شود.

6. محمد آخرین نبی دین اسلام است نه بنیانگذار آن. بعد از محمد نبی خبری از غیب به هیچ صورت و در هیچ قالبی به احدی نخواهد رسید. لذا کسانی که بعد از محمد نبی مدعی رسالت و نبوت هستند دروغگو محسوب می شوند.

7. دین اسلام نباید توسط علوم تجربی، فلسفه، اجماع، عرفان، شعر و نظرات اشخاص مورد ارزیابی و صحت سنجی قرار گیرد.

8. فرقه موسوم به قرآنیون یعنی همان کسانی که منکر صحت متن تورات و انجیل می باشند طبق آیات قرآن فرقه ای گمراه و گمراه کننده هستند.

9. مبنای ایمان، فهم و عمل به اصل متن کلام الهی است نه ترجمه های موجود در بازار. بنابراین هر انسانی مکلف است اصل متن کلام وحی را پیوسته مطالعه کرده و به ترجمه اکتفا نکند.

`}
          </p>
        </TypographyStylesProvider>
      </Text>
    </ScrollArea>
  );
}
